mruwzum/flipperzero-RogueMaster/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
#include "tracker_rules.h"

/* ---- Arduino-ESP32 core 2.x / 3.x compatibility ---------------------------
 *
 * Core 3.x (IDF 5.x) changed the BLE API in ways that break compilation
 * outright, not subtly. Reported by @h00die (issue #4) on core 3.3.11, which is
 * what a fresh Arduino install gets TODAY -- so before this shim, anyone
 * following our own README hit a wall of errors. Our CI pinned 2.0.17, so it
 * never saw any of it. A pin is not portability; it just hides the question.
 *
 * The three breaks:
 *
 *   1. BLEScan::start(secs, bool) returns BLEScanResults* in 3.x, by value in 2.x.
 *   2. getManufacturerData() / getName() / BLEUUID::toString() /
 *      BLEAddress::toString() return Arduino String in 3.x, std::string in 2.x.
 *   3. BLEAddress::getNative() returns const uint8_t* in 3.x, but uint8_t(*)[6]
 *      in 2.x -- so the 2.x code deref'd it once and 3.x gave back a single byte.
 *
 * Normalised to std::string here because the detection logic below does
 * substring work (find/rfind) that reads clearly in std::string and would have
 * to be rewritten for String. Conversion is LENGTH-PRESERVING on purpose:
 * manufacturer data is binary and can contain NUL bytes, so it is rebuilt with
 * the (pointer, length) constructor rather than treated as a C string -- a
 * strlen-style copy would silently truncate an advert at its first zero byte and
 * lose the Flock 0x09C8 payload we decode serials from.
 *
 * ESP_ARDUINO_VERSION_MAJOR is absent on very old cores; treat absent as 2.x.
 */
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
#define FLOCK_ARDUINO3 1
#else
#define FLOCK_ARDUINO3 0
#endif

#if FLOCK_ARDUINO3
/** Arduino String -> std::string, preserving embedded NULs. */
static inline std::string fstr(const String& s) {
    return std::string(s.c_str(), s.length());
}
/** 3.x hands back a pointer to the scan's internal results. */
#define FLOCK_SCAN(scan, secs) (*(scan)->start((secs), false))
/** Same, but `cont` keeps results accumulated from earlier slices. */
#define FLOCK_SCAN_CONT(scan, secs, cont) (*(scan)->start((secs), (cont)))
/** 3.x: already a flat pointer to the 6 address bytes. */
static inline const uint8_t* fble_addr_bytes(BLEAddress& a) {
    return a.getNative();
}
#else
/** 2.x already returns std::string; pass through so call sites stay identical. */
static inline std::string fstr(const std::string& s) {
    return s;
}
/** 2.x returns by value. */
#define FLOCK_SCAN(scan, secs) ((scan)->start((secs), false))
/** Same, but `cont` keeps results accumulated from earlier slices. */
#define FLOCK_SCAN_CONT(scan, secs, cont) ((scan)->start((secs), (cont)))
/** 2.x: uint8_t(*)[6], so one deref yields the uint8_t*. */
static inline const uint8_t* fble_addr_bytes(BLEAddress& a) {
    return *a.getNative();
}
#endif

// ---- Flock-associated OUI prefixes (29) ----------------------------------
// MUST stay byte-identical to flock_ouis[] in helpers/flock_db.c. There is no
// shared header (an Arduino sketch cannot include the app's), so editing one
// side alone would silently desync ESP-side `conf` scoring from the Flipper's.
// tools/check_oui_parity.py is a REQUIRED CI gate that catches exactly that.
// See flock_db.c for the provenance notes and the per-grade breakdown (contract
// manufacturer / flat-list orphan / weak upstream confidence).
//
// DEMOTED in v0.73: 48:27:ea (SAMSUNG) and a4:cf:12 (Espressif), both rated
// "low confidence, WiGLE crowdsource" upstream. They made a Samsung-based
// T-Mobile hotspot score LIKELY just for sending the wildcard probe every
// Wi-Fi client sends while scanning. They now live in docs/signatures.seed.json.
//
// RETRACTED UPSTREAM -- never re-add: f8:a2:d6 (hit on a Sony Media Player),
// 6c:cd:d6, 94:2a:6f, f4:e2:c6, cc:cc:cc, 00:0c:e7. f8:a2:d6 in particular has
// been removed TWICE: dropped for v0.44, silently re-added here by 93beede
// (2026-08-05) during a reflow, and shipped in v0.67-v0.71 scoring `conf=2` on
// any wildcard probe (see the ladder below). The parity gate did not catch it
// because that commit drifted this table and flock_db.c identically. The gate
// now also enforces the declared count and a retracted-prefix denylist.
//
// The last entry, b4:1e:52, is Flock Safety's own registered OUI (GainSec).
// Row layout matches flock_db.c line-for-line -- EXACTLY four entries per row --
// so the two can be diffed by eye. The 5-on-one-row drift is what hid 93beede.
static const uint8_t FLOCK_OUIS[][3] = {
    {0x70, 0xc9, 0x4e}, {0x3c, 0x91, 0x80}, {0xd8, 0xf3, 0xbc}, {0x80, 0x30, 0x49},
    {0xb8, 0x35, 0x32}, {0x14, 0x5a, 0xfc}, {0x74, 0x4c, 0xa1}, {0x08, 0x3a, 0x88},
    {0x9c, 0x2f, 0x9d}, {0xc0, 0x35, 0x32}, {0x94, 0x08, 0x53}, {0xe4, 0xaa, 0xea},
    {0xf4, 0x6a, 0xdd}, {0x24, 0xb2, 0xb9}, {0x00, 0xf4, 0x8d}, {0xd0, 0x39, 0x57},
    {0xe8, 0xd0, 0xfc}, {0xe0, 0x4f, 0x43}, {0xb8, 0x1e, 0xa4}, {0x70, 0x08, 0x94},
    {0x58, 0x8e, 0x81}, {0xec, 0x1b, 0xbd}, {0x3c, 0x71, 0xbf}, {0x58, 0x00, 0xe3},
    {0x90, 0x35, 0xea}, {0x5c, 0x93, 0xa2}, {0x64, 0x6e, 0x69}, {0x82, 0x6b, 0xf2},
    {0xb4, 0x1e, 0x52},
};
static const size_t FLOCK_OUI_COUNT = sizeof(FLOCK_OUIS) / sizeof(FLOCK_OUIS[0]);

// ---- SoundThinking / ShotSpotter acoustic sensors (1) --------------------
// A DIFFERENT DEVICE CLASS from the ALPRs above: these listen, they do not read
// plates. Matches are tagged `cls=a` on the wire so the Flipper can say which it
// found. MUST stay byte-identical to soundthinking_ouis[] in helpers/flock_db.c.
static const uint8_t SOUNDTHINKING_OUIS[][3] = {
    {0xd4, 0x11, 0xd6},
};
static const size_t SOUNDTHINKING_OUI_COUNT =
    sizeof(SOUNDTHINKING_OUIS) / sizeof(SOUNDTHINKING_OUIS[0]);

// ---- Axon Enterprise body-worn / in-car police equipment (1) -------------
// A THIRD DEVICE CLASS, and not fixed infrastructure: these MOVE with a person
// or a vehicle. Tagged `cls=x` on the wire. MUST stay byte-identical to
// axon_ouis[] in helpers/flock_db.c -- same CI parity gate as the other two.
//
// 00:25:df is Axon Enterprise's only IEEE registration, verified at the registry.
// Do NOT add prefixes by searching a vendor database for "axon" (that also hits
// Axon NETWORKS, Axona, Axonne, Interaxon, Maxon, Praxon, Paxonet, Yaxon -- all
// unrelated), nor from a curated "law enforcement" OUI list: one such list was
// checked entry by entry and 11 of 15 were wrong, including Apple prefixes filed
// as Digital Ally and Axis Communications filed as Flock Safety.
//
// REGISTRY-VERIFIED, NEVER FIELD-OBSERVED -- see flock_db.c for why that matters.
static const uint8_t AXON_OUIS[][3] = {
    {0x00, 0x25, 0xdf},
};
static const size_t AXON_OUI_COUNT = sizeof(AXON_OUIS) / sizeof(AXON_OUIS[0]);

// ---- State ---------------------------------------------------------------
//
// THREADING. promisc_cb() runs in the WiFi driver task (usually core 0) and
// loop()/handle_command() run in the Arduino task (core 1), so everything they
// share needs `volatile` at minimum, and a critical section wherever a read and
// a write must agree with each other.
//
// g_mux guards the two places where a torn read is not merely inaccurate but
// unsafe or wrong: the beacon ring (whose count BOUNDS an array write) and the
// Locator target (a 6-byte MAC that must be swapped atomically or promisc_cb
// homes on a half-old, half-new address for a few frames).
//
// The frame counters below are deliberately NOT protected. `volatile` does not
// make `++` atomic, so they can lose the odd increment under contention -- but
// they are display-only rate indicators reset every interval, and taking a lock
// per frame inside the WiFi callback would cost more than the drift.
static portMUX_TYPE g_mux = portMUX_INITIALIZER_UNLOCKED;

