mruwzum/flipperzero-RogueMaster/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
static volatile bool g_scanning = true;
static volatile uint32_t g_frames = 0;
static volatile uint32_t g_hits = 0;
static volatile uint32_t g_deauths = 0; // deauth + disassoc frames seen (attack indicator)
static volatile uint8_t g_channel = 1;
static uint8_t g_lock_channel = 0; // 0 = hop
/** Highest 2.4 GHz channel the hopper visits. See the hop block in loop(). */
#define MAX_HOP_CHANNEL 13

/* ---- Dual-band (5 GHz) support -------------------------------------------
 *
 * A 2.4-only companion CANNOT SEE a Flock uplink on 5 GHz -- not "sees it
 * weakly", cannot see it at all. The ESP32-C5 is the first Espressif part with a
 * 5 GHz radio, so on that chip we hop both bands.
 *
 * Gated on the SoC capability, not on a board name: SOC_WIFI_SUPPORT_5G comes
 * from the IDF's own soc_caps.h, so a classic ESP32/S3/C3 compiles exactly as
 * before and pays nothing (the 5 GHz table is not even emitted). Requires
 * Arduino core 3.x, which is where the C5 exists at all.
 *
 * Channel list is the 28 20 MHz channels the IDF enumerates for this radio
 * (esp_wifi_types_generic.h). Band switching is done purely by setting the
 * channel: the IDF docs say to prefer esp_wifi_set_channel() over
 * esp_wifi_set_band(), and it moves bands on its own once band mode is AUTO.
 *
 * COST, stated plainly: a full sweep goes from 13 channels to 41. At the same
 * 300 ms dwell that is ~12.3 s per sweep instead of ~3.9 s, so a given camera is
 * revisited a third as often. That is the honest price of covering a band we
 * currently cannot see, and `band 2g` returns the fast sweep for anyone who
 * wants it.
 */
#if defined(SOC_WIFI_SUPPORT_5G) && SOC_WIFI_SUPPORT_5G
#define FLOCK_HAS_5GHZ 1
#else
#define FLOCK_HAS_5GHZ 0
#endif

#if FLOCK_HAS_5GHZ
/** 5 GHz 20 MHz channels, incl. DFS (52-144) -- we only ever listen. */
static const uint8_t CHANNELS_5G[] = {36,  40,  44,  48,  52,  56,  60,  64,  100, 104,
                                      108, 112, 116, 120, 124, 128, 132, 136, 140, 144,
                                      149, 153, 157, 161, 165, 169, 173, 177};
#define CHANNELS_5G_COUNT (sizeof(CHANNELS_5G) / sizeof(CHANNELS_5G[0]))
#endif

/** Which band(s) the hopper sweeps. `band 2g|5g|all` selects at runtime. */
typedef enum {
    FlockBand2G = 0,
    FlockBand5G = 1,
    FlockBandAll = 2,
} FlockBandSel;

/* Default: sweep everything the radio can reach. On a 2.4-only part this is
 * identical to the old behaviour, because the 5 GHz list does not exist. */
#if FLOCK_HAS_5GHZ
static FlockBandSel g_band = FlockBandAll;
#else
static FlockBandSel g_band = FlockBand2G;
#endif

/** Hop cursor: index into the logical (2.4 then 5) channel sequence. */
static uint16_t g_hop_i = 0;

/** True if `ch` is a 5 GHz channel number (2.4 GHz tops out at 14). */
static inline bool is_5ghz_channel(uint8_t ch) {
    return ch >= 36;
}

/** Number of channels in the current sweep. */
static uint16_t hop_count() {
    uint16_t n = 0;
    if(g_band == FlockBand2G || g_band == FlockBandAll) n += MAX_HOP_CHANNEL;
#if FLOCK_HAS_5GHZ
    if(g_band == FlockBand5G || g_band == FlockBandAll) n += CHANNELS_5G_COUNT;
#endif
    return n ? n : MAX_HOP_CHANNEL; // never zero: degrade to 2.4 rather than stall
}

/** i-th channel of the current sweep (2.4 GHz first, then 5 GHz). */
static uint8_t hop_channel(uint16_t i) {
    bool do_24 = (g_band == FlockBand2G || g_band == FlockBandAll);
#if FLOCK_HAS_5GHZ
    bool do_5 = (g_band == FlockBand5G || g_band == FlockBandAll);
#else
    bool do_5 = false;
#endif
    if(do_24) {
        if(i < MAX_HOP_CHANNEL) return (uint8_t)(i + 1);
        i -= MAX_HOP_CHANNEL;
    }
#if FLOCK_HAS_5GHZ
    if(do_5 && i < CHANNELS_5G_COUNT) return CHANNELS_5G[i];
#else
    (void)do_5;
#endif
    return 1;
}
static uint32_t g_last_status = 0;
static uint32_t g_last_hop = 0;
static uint32_t g_deauths_last = 0; // for per-interval deauth rate
static uint32_t g_last_da = 0; // rate-limit DA attribution lines

// ---- Active attack-tool detection (emitted as ATK lines, ~1 Hz) -----------
// These are RATE signals reset every status interval, so the alert clears when
// the attack stops. Thresholds are deliberately conservative to avoid false
// positives in dense-but-benign RF; tune for your environment.
//   probeflood : abnormal probe-request rate (KARMA / mass-probe tools)
//   beaconflood: many DISTINCT beaconing BSSIDs/s (Marauder/Pineapple SSID spam)
//   blespam    : a flood of impersonation BLE adverts (Flipper/ESP BLE spam)
#define PROBE_FLOOD_MIN  80 // probe requests in one ~1 s interval
#define BEACON_FLOOD_MIN 40 // distinct beaconing BSSIDs in one ~1 s interval
#define BLE_SPAM_MIN     12 // impersonation-class adverts in one BLE scan
static volatile uint32_t g_probe_reqs = 0; // probe requests this interval (reset ~1 Hz)
#define BEACON_RING 64
static uint32_t g_beacon_ring[BEACON_RING]; // recent beacon-BSSID hashes this interval
static uint8_t g_beacon_ring_n = 0;
static uint32_t g_beacon_distinct = 0; // distinct beaconing BSSIDs this interval

// Note a beacon's source BSSID; counts it once per interval. Approximate by
// design (a small ring + best-effort across the WiFi-callback / loop tasks) --
// it only needs to tell "a handful of real APs" from "a spam flood."
static void note_beacon_bssid(const uint8_t* bssid) {
    uint32_t h = 2166136261u; // FNV-1a over the 6 BSSID bytes (inlined: no fwd dep)
    for(int i = 0; i < 6; i++) {
        h ^= bssid[i];
        h *= 16777619u;
    }
    // The scan and the append must see the SAME g_beacon_ring_n: it is both the
    // dedup bound and the write index, and loop() zeroes it from the other core
    // every status interval. Hash outside the lock, hold it only for the ring.
    portENTER_CRITICAL(&g_mux);
    for(uint8_t i = 0; i < g_beacon_ring_n; i++) {
        if(g_beacon_ring[i] == h) { // already counted this interval
            portEXIT_CRITICAL(&g_mux);
            return;
        }
    }
    if(g_beacon_ring_n < BEACON_RING) {
        g_beacon_ring[g_beacon_ring_n++] = h;
        g_beacon_distinct++;
    }
    portEXIT_CRITICAL(&g_mux);
}

// ---- Locator: stream live RSSI for one target so the app can home in on it ---
// 'w' Wi-Fi (match the MAC in promiscuous frames, channel-locked) or 'b' BLE
// (match the addr in a repeating scan). MAC kept BOTH as bytes (Wi-Fi, compared
// to raw frame bytes) and as the lowercase hex string (BLE, compared to the
// same toString() form the BLE line is built from -- avoids byte-order traps).
// volatile: promisc_cb (WiFi task) reads g_locate_kind as the fast gate before
// touching the target. The target bytes themselves are swapped under g_mux.
static volatile char g_locate_kind = 0; // 0 none / 'w' / 'b'
static uint8_t g_locate_mac[6];
static char g_locate_macs[13]; // lowercase hex, no separators
static uint8_t g_locate_ch = 0;
static int g_locate_best = -127; // strongest RSSI since the last LOC emit (Wi-Fi)
static uint32_t g_last_loc = 0; // LOC emit throttle

