mruwzum/flipperzero-RogueMaster/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
static int hexv(char c) {
    if(c >= '0' && c <= '9') return c - '0';
    if(c >= 'a' && c <= 'f') return c - 'a' + 10;
    if(c >= 'A' && c <= 'F') return c - 'A' + 10;
    return -1;
}
static bool parse_hexmac(const char* s, uint8_t out[6]) {
    for(int i = 0; i < 6; i++) {
        int hi = hexv(s[i * 2]), lo = hexv(s[i * 2 + 1]);
        if(hi < 0 || lo < 0) return false;
        out[i] = (uint8_t)((hi << 4) | lo);
    }
    return true;
}

// Dual-band (WiFi + BLE) Flock detection. BLE is initialised once and kept
// resident (avoids the Bluedroid init/deinit heap leak); the radio is shared by
// toggling promiscuous off during a BLE scan, then back on. flockcombo
// interleaves a WiFi-promiscuous phase with a periodic BLE scan phase.
static bool g_ble_inited = false;
static BLEScan* g_ble = nullptr;
static bool g_combo = false;
static uint32_t g_phase_start = 0;
#define COMBO_WIFI_MS 9000 // ~3 channel sweeps before a BLE scan (WiFi-biased)
#define COMBO_BLE_SEC 3 // BLE scan seconds (BLE adverts repeat fast)

/**
 * First-byte rejection bitmap for the OUI tables.
 *
 * promisc_cb() tests TWO addresses on EVERY management frame, and each test used
 * to walk all 31 Flock prefixes plus the SoundThinking one -- up to 64 three-byte
 * comparisons per frame, inside the WiFi driver callback, before any filtering.
 * The overwhelming majority of frames match nothing.
 *
 * 256 bits (32 bytes) say whether ANY table entry starts with a given byte, so
 * the common no-match case costs one array index and one bit test. Built once at
 * boot by oui_index_init(); the tables are const, so it can never go stale.
 */
// Built during C++ static initialisation, i.e. before setup() and before any
// frame can arrive. Deliberately NOT an init function called from setup():
// forgetting that call would make every OUI test return false and silently kill
// all detection, which is the worst possible failure mode for this app. Deriving
// the index from the tables in a constructor makes that unrepresentable.
static const struct OuiFirstIndex {
    uint8_t bits[32]; // bit b set => some prefix starts with byte b
    OuiFirstIndex() : bits{} {
        for(size_t i = 0; i < FLOCK_OUI_COUNT; i++) {
            uint8_t b = FLOCK_OUIS[i][0];
            bits[b >> 3] |= (uint8_t)(1u << (b & 7));
        }
        for(size_t i = 0; i < SOUNDTHINKING_OUI_COUNT; i++) {
            uint8_t b = SOUNDTHINKING_OUIS[i][0];
            bits[b >> 3] |= (uint8_t)(1u << (b & 7));
        }
        // Axon too. Miss this and oui_first_possible() rejects every Axon frame
        // before ax_oui_match() is ever reached -- detection would be silently
        // dead while the table looked perfectly correct.
        for(size_t i = 0; i < AXON_OUI_COUNT; i++) {
            uint8_t b = AXON_OUIS[i][0];
            bits[b >> 3] |= (uint8_t)(1u << (b & 7));
        }
    }
} g_oui_index;

static inline bool oui_first_possible(uint8_t b) {
    return (g_oui_index.bits[b >> 3] >> (b & 7)) & 1;
}

static bool flock_oui_match(const uint8_t* mac) {
    if(!oui_first_possible(mac[0])) return false; // fast reject, no table walk
    for(size_t i = 0; i < FLOCK_OUI_COUNT; i++) {
        if(mac[0] == FLOCK_OUIS[i][0] && mac[1] == FLOCK_OUIS[i][1] &&
           mac[2] == FLOCK_OUIS[i][2])
            return true;
    }
    return false;
}

static bool st_oui_match(const uint8_t* mac) {
    if(!oui_first_possible(mac[0])) return false; // fast reject, no table walk
    for(size_t i = 0; i < SOUNDTHINKING_OUI_COUNT; i++) {
        if(mac[0] == SOUNDTHINKING_OUIS[i][0] && mac[1] == SOUNDTHINKING_OUIS[i][1] &&
           mac[2] == SOUNDTHINKING_OUIS[i][2])
            return true;
    }
    return false;
}

static bool ax_oui_match(const uint8_t* mac) {
    if(!oui_first_possible(mac[0])) return false; // fast reject, no table walk
    for(size_t i = 0; i < AXON_OUI_COUNT; i++) {
        if(mac[0] == AXON_OUIS[i][0] && mac[1] == AXON_OUIS[i][1] &&
           mac[2] == AXON_OUIS[i][2])
            return true;
    }
    return false;
}

// Any known surveillance-vendor prefix, any class. Scoring is class-agnostic;
// the class itself rides along in the `cls=` field.
static bool oui_match(const uint8_t* mac) {
    return flock_oui_match(mac) || st_oui_match(mac) || ax_oui_match(mac);
}

static char lc(char c) {
    return (c >= 'A' && c <= 'Z') ? (char)(c + 32) : c;
}

/**
 * True if `s` is EXACTLY "flock-" + 6 hex digits: the provisioning-AP name.
 *
 * Mirrors is_flock_provisioning_ssid() in helpers/flock_db.c -- keep the two in
 * step, same hand-sync rule as the OUI tables above.
 *
 * ANCHORED on purpose. This used to be a bare strstr(buf, "flock-"), which
 * confirmed every benign name that merely contained the substring:
 * "Flock-Guest", "Flock-Safety-Corp", "Flock-12345". The Flipper takes the
 * companion's conf verbatim on this path, so that went straight to the screen
 * as CONFIRMED. Those now fall through to the "likely" check below.
 *
 * `s` is already lower-cased by the caller, so only a-f need testing.
 */
static bool is_flock_provisioning_ssid(const char* s) {
    if(strncmp(s, "flock-", 6) != 0) return false;
    for(int i = 6; i < 12; i++) {
        char c = s[i]; // '\0' on a short SSID is not hex -> correctly rejected
        bool hex = (c >= '0' && c <= '9') || (c >= 'a' && c <= 'f');
        if(!hex) return false;
    }
    return s[12] == '\0'; // nothing may follow the 6 hex digits
}

// Returns: 0 none, 2 likely (flock/flck substring), 3 confirmed
// (^flock-[0-9a-f]{6}$ or the test_flck dev SSID, CVE-2025-59409)
static int ssid_score(const char* s, int len) {
    if(len <= 0) return 0;
    char buf[64];
    int n = len < 63 ? len : 63;
    for(int i = 0; i < n; i++) buf[i] = lc(s[i]);
    buf[n] = 0;
    if(is_flock_provisioning_ssid(buf) || strstr(buf, "test_flck")) return 3;
    if(strstr(buf, "flock") || strstr(buf, "flck")) return 2;
    return 0;
}

// Append up to `max` bytes of `s` into buf[*pos], stripping ',', CR, LF and control chars
// to '.' so the payload can't break the line protocol. Bounds-checked; advances *pos.
// Callers assemble a whole line in one buffer and emit it with a SINGLE Serial.write, so a
// line built in promisc_cb (WiFi task) can't interleave on the UART with loop()'s status
// lines -- a single HardwareSerial::write() is atomic w.r.t. the other task's writes.
static void buf_append_escaped(char* buf, size_t bufsz, size_t* pos, const char* s, int len, int max) {
    for(int i = 0; i < len && i < max && *pos + 1 < bufsz; i++) {
        char c = s[i];
        if(c == ',' || c == '\r' || c == '\n' || (uint8_t)c < 0x20) c = '.';
        buf[(*pos)++] = c;
    }
}

/**
 * Append a printf-formatted field at buf[*pos], clamping to the buffer.
 *
 * snprintf() returns what it WOULD have written, so the natural-looking
 * `pos += snprintf(buf + pos, sizeof(buf) - pos, ...)` overshoots `pos` past the
 * buffer on truncation. The NEXT call then computes `sizeof(buf) - pos` as a
 * size_t UNDERFLOW -- a huge length against an out-of-bounds pointer. Chained
 * appends must never accumulate the raw return value; this clamps instead.
 */
static void buf_appendf(char* buf, size_t bufsz, size_t* pos, const char* fmt, ...) {
    if(*pos + 1 >= bufsz) return; // no room for even one byte + NUL
    va_list ap;
    va_start(ap, fmt);
    int n = vsnprintf(buf + *pos, bufsz - *pos, fmt, ap);
    va_end(ap);
    if(n < 0) return; // encoding error
    size_t avail = bufsz - *pos - 1;
    *pos += ((size_t)n > avail) ? avail : (size_t)n;
}

// ---- Sustained-probe-rate gate -------------------------------------------
//
// WHY. "Flock OUI + wildcard probe request -> LIKELY" is too generous on its own,
// because a wildcard probe is the most ordinary frame a Wi-Fi client emits: it is
// literally what scanning for a network looks like. And FLOCK_OUIS is mostly chip
// vendors, not Flock -- 21 of its entries are Liteon. So an ordinary consumer
// device built on the same silicon, doing nothing but looking for a network, was
// scoring LIKELY. A user reported exactly that for a T-Mobile hotspot.
//
// WHAT SEPARATES THEM IS RATE, NOT BEHAVIOUR. A fielded Flock camera runs in
// station mode and sprays wildcard probes roughly every 125 ms -- about eight a
// second, continuously, because it is trying to phone home. A phone or a hotspot
// scanning emits a short burst on each channel and then goes quiet for tens of
// seconds. Same frame type, completely different cadence.
//
// So: require several probes from the same transmitter inside a short window
// before OUI+probe may reach conf=2. A camera clears PROBE_BURST_MIN in well
// under a second; a client sweeping channels rarely puts that many on OUR channel
// inside the window.
//
// THRESHOLDS ARE NOT FIELD-TUNED. 125 ms is upstream's figure, but the client-side
// distribution has never been measured here, so these are deliberately loose --
// they are set to catch the reported false positive without risking a real
// camera, not to be optimal. The observed count is reported on the wire as
// `pr=<n>` precisely so it can be tuned from real captures instead of guessed at
// again. Widen the window or lower the threshold only with data.
#define PROBE_TRACK_N     24   // transmitters tracked (LRU); urban scans are busy
#define PROBE_WINDOW_MS   2000 // sliding window a burst must land inside
#define PROBE_BURST_MIN   3    // probes within the window to count as "sustained"

struct ProbeTrack {
    uint8_t mac[6];
    uint8_t count;
    uint32_t first_ms;
    uint32_t last_ms;
};
static ProbeTrack g_probe_track[PROBE_TRACK_N];

/**
 * Record one probe request from `mac` and return how many it has sent inside the
 * current window (>= 1). Called on EVERY candidate probe, before the sequence-run
 * coalescer -- the coalescer deliberately suppresses repeats, so counting after it
 * would always see 1 and the gate would reject everything including real cameras.
 */
static uint8_t probe_rate_bump(const uint8_t* mac) {
    uint32_t now = millis();
    int slot = -1, oldest = 0;
    for(int i = 0; i < PROBE_TRACK_N; i++) {
        if(memcmp(g_probe_track[i].mac, mac, 6) == 0 && g_probe_track[i].count) {
            slot = i;
            break;
        }
        // millis() wraps every ~49 days; the subtraction is unsigned so the
        // comparison stays correct across the wrap.
        if((uint32_t)(now - g_probe_track[i].last_ms) >
           (uint32_t)(now - g_probe_track[oldest].last_ms)) {
            oldest = i;
        }
    }
    if(slot < 0) { // evict the least recently used entry
        slot = oldest;
        memcpy(g_probe_track[slot].mac, mac, 6);
        g_probe_track[slot].count = 0;
    }
    ProbeTrack* e = &g_probe_track[slot];
    if(e->count == 0 || (uint32_t)(now - e->first_ms) > PROBE_WINDOW_MS) {
        e->count = 1; // window expired -> start a fresh one
        e->first_ms = now;
    } else if(e->count < 255) {
        e->count++;
    }
    e->last_ms = now;
    return e->count;
}

