mruwzum/flipperzero-RogueMaster/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
// ---- B1: probe IE-fingerprint + sequence-number coalescer ----------------
//
// The whole OUI/SSID ladder collapses the day Flock randomizes the probe MAC.
// The probe *body* is MAC-independent: the ordered set of tagged Information
// Elements (supported rates, HT/VHT/HE caps, vendor-specific 0xDD OUI+type) is
// baked into the WiFi SoC driver and can't be scrambled without breaking
// 802.11. We hash that skeleton into a uint32 the Flipper compares against a
// curated table. This is a device-CLASS / firmware-stack match, NOT a unique
// device ID -- the Flipper reports it as a candidate class match only.
//
// We hash only the *skeleton* (tag id + length, plus the first OUI+type bytes
// of vendor-specific IEs), never per-frame variable contents, so the same probe
// template hashes identically regardless of the (possibly randomized) MAC.

#define FNV1A_OFFSET 0x811c9dc5u
#define FNV1A_PRIME 0x01000193u

static inline uint32_t fnv1a_u8(uint32_t h, uint8_t b) {
    return (h ^ b) * FNV1A_PRIME;
}

// FNV-1a over the IE skeleton of a probe request. `p` points at the frame body,
// `len` is the body length (FCS already removed). Tagged params start at byte
// 24 (probe request has no fixed params). For each IE we fold in (tag_id,
// length); for vendor-specific (0xDD) we also fold in up to the first 5 bytes
// (3-byte OUI + 1-2 type/subtype) -- enough to distinguish vendor IEs without
// shipping their variable payloads. Returns 0 if there are no parseable IEs.
static uint32_t ie_skeleton_hash(const uint8_t* p, int len) {
    uint32_t h = FNV1A_OFFSET;
    int off = 24; // tagged parameters begin here for a probe request
    bool any = false;
    while(off + 2 <= len) {
        uint8_t tag = p[off];
        uint8_t tlen = p[off + 1];
        if(off + 2 + tlen > len) break; // truncated IE -> stop
        h = fnv1a_u8(h, tag);
        h = fnv1a_u8(h, tlen);
        if(tag == 0xDD) { // vendor-specific: fold OUI + type (first 5 bytes)
            int n = tlen < 5 ? tlen : 5;
            for(int i = 0; i < n; i++) h = fnv1a_u8(h, p[off + 2 + i]);
        }
        any = true;
        off += 2 + tlen;
    }
    return any ? h : 0;
}

// Sequence-number-run coalescer. A MAC-cycling Flock burst sprays many probes
// from different (randomized) MACs but with a *contiguous* 802.11 sequence
// number run -- the SoC's seq counter increments across the burst regardless of
// the source address. We treat such a run as ONE logical sighting and suppress
// the duplicates on the ESP side so they never flood the Flipper's 64-entry
// table. Keyed on the IE-skeleton hash so unrelated traffic with nearby seq
// numbers isn't merged.
#define SEQ_RUN_GAP 4 // max seq-num step to still count as the same burst
#define SEQ_RUN_MS 1500 // a run older than this is stale; start fresh
static uint32_t g_seq_fp = 0; // IE hash of the current run (0 = none)
static uint16_t g_seq_last = 0; // last 802.11 sequence number in the run
static uint32_t g_seq_t = 0; // millis() of the last frame in the run

// Returns true if this frame should be SUPPRESSED as a duplicate within an
// in-progress MAC-cycling burst (same IE fingerprint, monotonic seq-num run).
static bool seq_run_duplicate(uint32_t fp, uint16_t seq) {
    if(fp == 0) return false; // no fingerprint -> can't coalesce
    uint32_t now = millis();
    bool fresh = (now - g_seq_t) <= SEQ_RUN_MS;
    if(fresh && fp == g_seq_fp) {
        uint16_t step = (uint16_t)(seq - g_seq_last); // wraps mod 4096 naturally
        if(step != 0 && step <= SEQ_RUN_GAP) {
            g_seq_last = seq; // extend the run, suppress this frame
            g_seq_t = now;
            return true;
        }
    }
    // New run (or a gap too large / stale): this frame is the run's first
    // sighting -> report it and start tracking from here.
    g_seq_fp = fp;
    g_seq_last = seq;
    g_seq_t = now;
    return false;
}

static void promisc_cb(void* buf, wifi_promiscuous_pkt_type_t type) {
    if(type != WIFI_PKT_MGMT) return;
    const wifi_promiscuous_pkt_t* pkt = (const wifi_promiscuous_pkt_t*)buf;
    const uint8_t* p = pkt->payload;
    // sig_len includes the 4-byte FCS; drop it so SSID bounds checks stay inside
    // the actual frame body.
    int len = pkt->rx_ctrl.sig_len;
    if(len < 28) return;
    len -= 4;

    // Snapshot the channel now: the hopper may advance before we finish.
    uint8_t frame_channel = g_channel;

    g_frames++;

    uint8_t subtype = (p[0] >> 4) & 0x0F;

    // Active-attack rate sampling (counted on EVERY frame, before any Flock
    // candidacy filtering): probe-request floods and beacon-spam (many distinct
    // beaconing BSSIDs). Flushed/evaluated in the ~1 Hz status block.
    if(subtype == 0x04) {
        g_probe_reqs++; // probe request
    } else if(subtype == 0x08) {
        note_beacon_bssid(p + 16); // beacon: addr3 = BSSID
    }

    // Locator (Wi-Fi): track the strongest RSSI of any frame to/from the target
    // MAC (addr1/2/3). loop() emits it as a throttled LOC line.
    if(g_locate_kind == 'w') {
        int r = pkt->rx_ctrl.rssi;
        if(memcmp(p + 4, g_locate_mac, 6) == 0 || memcmp(p + 10, g_locate_mac, 6) == 0 ||
           memcmp(p + 16, g_locate_mac, 6) == 0) {
            if(r > g_locate_best) g_locate_best = r;
        }
    }

    // Deauthentication (0x0C) / disassociation (0x0A) frames: a flood of these
    // is the signature of a deauth attack or an evil-twin kicking clients off.
    if(subtype == 0x0C || subtype == 0x0A) {
        g_deauths++;
        // Attribution: report the targeted BSSID (addr3) + channel, rate-limited
        // so a heavy flood can't saturate the UART.
        uint32_t now_da = millis();
        if(now_da - g_last_da >= 250) {
            g_last_da = now_da;
            const uint8_t* b = p + 16; // addr3 = BSSID
            Serial.printf(
                "DA,%02x%02x%02x%02x%02x%02x,%u\n",
                b[0], b[1], b[2], b[3], b[4], b[5], frame_channel);
        }
    }

    char ftype = 'O';
    const char* ssid = NULL;
    int ssid_len = 0;

