mruwzum/flipperzero-RogueMaster/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
    // Locate SSID element (tag 0) within tagged parameters.
    int tag_off = -1;
    if(subtype == 0x04) { // probe request
        ftype = 'P';
        tag_off = 24;
    } else if(subtype == 0x08) { // beacon
        ftype = 'B';
        tag_off = 36;
    } else if(subtype == 0x05) { // probe response
        ftype = 'R';
        tag_off = 36;
    }
    bool ssid_ie_found = false;
    if(tag_off >= 0 && tag_off + 2 <= len && p[tag_off] == 0x00) {
        ssid_ie_found = true;
        ssid_len = p[tag_off + 1];
        if(tag_off + 2 + ssid_len <= len) {
            ssid = (const char*)(p + tag_off + 2);
        } else {
            // The IE claims more bytes than the frame holds -- a truncated or
            // malformed capture. Retract the whole finding, don't just zero the
            // length: leaving ssid_ie_found set made the all-NUL scan below pass
            // vacuously (zero bytes to disagree with it) and every truncated
            // frame got reported as a hidden network. A parse miss is not
            // evidence of concealment.
            ssid_ie_found = false;
            ssid_len = 0;
        }
    }

    // Hidden-SSID beaconing: an AP that advertises but withholds its name. Two
    // encodings are legal and both appear in the wild -- a zero-length SSID IE,
    // and a length-N IE of all NULs -- so test for both.
    //
    // Only meaningful for beacons and probe RESPONSES: those identify an AP. A
    // probe REQUEST with no SSID is an ordinary wildcard scan from a client and
    // says nothing about hiding. And we only claim "hidden" when the SSID IE was
    // actually located: a parse miss is not evidence of concealment.
    bool hidden = false;
    if(ssid_ie_found && (subtype == 0x08 || subtype == 0x05)) {
        hidden = true;
        for(int i = 0; i < ssid_len; i++) {
            if(ssid[i] != '\0') {
                hidden = false;
                break;
            }
        }
    }

    int s_score = ssid ? ssid_score(ssid, ssid_len) : 0;
    bool oui_tx = oui_match(p + 10); // addr2 = transmitter
    bool oui_rx = oui_match(p + 4); // addr1 = receiver (silent station)
    bool is_probe = (ftype == 'P');
    bool wildcard = is_probe && (ssid_len == 0); // broadcast/wildcard probe

    // Count this probe against its transmitter BEFORE the coalescer downstream
    // suppresses repeats. Only the transmitter is rate-tracked: on an oui_rx hit
    // the frame was sent TO the Flock-OUI device by someone else, so the cadence
    // belongs to that someone else and says nothing about the receiver.
    uint8_t probe_rate = 0;
    if(is_probe) probe_rate = probe_rate_bump(p + 10); // addr2 = transmitter
    bool sustained = probe_rate >= PROBE_BURST_MIN;

    int conf = 0;
    if(s_score == 3)
        conf = 3; // confirmed Flock SSID name
    else if(oui_tx && wildcard && sustained)
        conf = 2; // OUI + SUSTAINED wildcard probing -> "likely". The rate gate is
                  // what makes this usable: FLOCK_OUIS is mostly chip vendors
                  // (21 Liteon entries), so without it any consumer device on the
                  // same silicon scored LIKELY just for scanning -- the reported
                  // T-Mobile hotspot false positive. A real camera probes ~8x a
                  // second and clears the gate almost instantly.
                  // Reserve conf=3 for an SSID-name / IE-fp match.
    else if(oui_tx && is_probe && sustained)
        conf = 2; // same rule for a directed probe from the OUI device itself
    else if(oui_rx && is_probe)
        conf = 2; // OUI on the SILENT RECEIVER: a frame addressed to a Flock-OUI
                  // device by some other station. Deliberately NOT rate-gated --
                  // the rate would be the sender's, not this device's, and this is
                  // upstream's key technique for catching a dormant camera that is
                  // not transmitting at all. Narrower and rarer than the tx paths.
    else if(s_score == 2)
        conf = 2;
    // NO conf=1 FOR A BARE OUI MATCH ANY MORE.
    //
    // A Flock camera is not an access point. Flock's management AP was
    // deactivated around December 2025 and the cameras moved to station mode --
    // they now emit wildcard PROBE REQUESTS roughly every 125 ms and do not
    // beacon (see the upstream flock-you research this OUI list comes from).
    // So an OUI hit on a BEACON is, by construction, not a camera. It is some
    // other product built on the same silicon.
    //
    // And this list is mostly shared silicon-vendor ranges -- Espressif, Liteon
    // and friends -- so "beacons, and has one of these OUIs" describes an
    // enormous number of ordinary consumer devices. It reported a T-Mobile
    // gateway (SSID "tmobile-5416") as a possible ALPR camera, which is exactly
    // the failure this project says it will not accept: a false positive is
    // worse than a missed detection.
    //
    // Nothing real is lost. Anything that IS a camera still reaches conf=2 via
    // the probe-request branches above, and conf=3 via an SSID name or IE
    // fingerprint. The only sightings dropped are OUI-only ones with no probe
    // behaviour and no name -- which is precisely the set that cannot be
    // distinguished from an unrelated device sharing a chip vendor.

    if(conf == 0) return; // not a candidate; drop to keep UART quiet

    // B1: fingerprint the probe body (MAC-independent device-class signature)
    // and coalesce MAC-cycling bursts via the 802.11 sequence-number run, so a
    // randomized-MAC spray collapses to one logical sighting before it can flood
    // the Flipper's 64-entry table. Only probe requests carry a meaningful IE
    // skeleton. The coalescer runs only on candidate frames so unrelated noise
    // can't capture the run slot and suppress a real detection.
    uint32_t ie_fp = 0;
    if(is_probe) {
        ie_fp = ie_skeleton_hash(p, len);
        // 802.11 sequence control: bytes 22-23, seq number is the top 12 bits.
        uint16_t seq = ((uint16_t)p[23] << 8 | p[22]) >> 4;
        if(seq_run_duplicate(ie_fp, seq)) return; // duplicate in an active burst
    }

