mruwzum/flipperzero-RogueMaster/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
// Locator (BLE): one short scan; emit the target's RSSI if seen. Builds the same
// lowercased, colon-stripped toString() form the BLE line uses, so the comparison
// is byte-order-safe against the addr the app originally parsed.
static void ble_locate_scan() {
    ble_ensure_init();
    esp_wifi_set_promiscuous(false);
    BLEScanResults res = FLOCK_SCAN(g_ble, 1);
    int best = -127;
    int n = res.getCount();
    for(int i = 0; i < n; i++) {
        BLEAdvertisedDevice d = res.getDevice(i);
        std::string a = fstr(d.getAddress().toString());
        char addr[13];
        int k = 0;
        for(size_t j = 0; j < a.size() && k < 12; j++) {
            char c = a[j];
            if(c == ':') continue;
            addr[k++] = (c >= 'A' && c <= 'Z') ? (char)(c + 32) : c;
        }
        addr[k] = 0;
        if(strcmp(addr, g_locate_macs) == 0) {
            int r = d.getRSSI();
            if(r > best) best = r;
        }
    }
    g_ble->clearResults();
    if(best > -127) Serial.printf("LOC,%d\n", best);
}

// ---- explicit tracker actions -------------------------------------------
//
// These are deliberately separate from the passive scan path. The Flipper can
// request them only from the selected BLE detail view, and the companion
// re-validates the fresh advertisement before it connects. Ring is limited to
// an Apple/Find My tracker advertising the separated payload: that is the
// non-owner anti-stalking path, not the owner-only Find My control path.
#define DULT_NON_OWNER_SERVICE "15190001-12f4-c226-88ed-2ac5579f2a85"
#define DULT_NON_OWNER_CHAR    "8e0c0001-1d68-fb92-bf61-48377421680e"
#define FIND_MY_SERVICE        "fd44"
#define FIND_MY_NON_OWNER_CHAR "4f860003-943b-49ef-bed4-2f730304427a"
#define AIRTAG_SOUND_SERVICE   "7dfc9000-7d1c-4951-86aa-8d9728f8d66c"
#define AIRTAG_SOUND_CHAR      "7dfc9001-7d1c-4951-86aa-8d9728f8d66c"

static volatile bool g_ring_response_ready = false;
static volatile uint16_t g_ring_response_status = 0xFFFF;

static void ble_action_emit(const char* op, const char* status, int rssi, bool have_rssi) {
    if(have_rssi)
        Serial.printf("ACT,%s,%s,%d\n", op, status, rssi);
    else
        Serial.printf("ACT,%s,%s\n", op, status);
}

static void ble_action_restore_radio() {
    g_ble->clearResults();
    esp_wifi_set_promiscuous(true);
    set_channel(g_channel);
}

static void ble_action_compact_address(BLEAdvertisedDevice& d, char out[13]) {
    std::string a = fstr(d.getAddress().toString());
    int k = 0;
    for(size_t i = 0; i < a.size() && k < 12; i++) {
        char c = a[i];
        if(c == ':') continue;
        out[k++] = (c >= 'A' && c <= 'F') ? (char)(c + 32) : c;
    }
    out[k] = 0;
}

static bool ble_action_has_service(BLEAdvertisedDevice& d, const char* token) {
    for(int i = 0; i < d.getServiceUUIDCount(); i++) {
        std::string u = fstr(d.getServiceUUID(i).toString());
        if(u.find(token) != std::string::npos) return true;
    }
    return false;
}

/** Classify only the tracker families for which an explicit action is allowed. */
static int ble_action_tracker_category(BLEAdvertisedDevice& d, bool* separated) {
    if(separated) *separated = false;
    bool apple_payload_seen = false;

    if(d.haveManufacturerData()) {
        std::string md = fstr(d.getManufacturerData());
        int company = md.length() >= 2 ? ((uint8_t)md[0] | ((uint8_t)md[1] << 8)) : -1;
        if(company == APPLE_FIND_MY_COMPANY_ID) {
            apple_payload_seen = true;
            AppleFindMyAdvert advert;
            if(apple_find_my_decode(
                   (const uint8_t*)md.data(), md.size(), &advert) &&
               apple_find_my_is_tracker(&advert)) {
                if(separated) *separated = advert.separated;
                return BLE_TRACKER_CAT_AIRTAG;
            }
        }
    }

    // A valid Apple manufacturer block that decoded as a phone, Mac, or
    // AirPods must not be rescued by a broad service-UUID fallback.
    if(apple_payload_seen) return 0;

    if(d.haveServiceUUID()) {
        if(ble_action_has_service(d, "fd44") || ble_action_has_service(d, "fcb2") ||
           ble_action_has_service(d, "15190001"))
            return BLE_TRACKER_CAT_AIRTAG;
        if(ble_action_has_service(d, "feed") || ble_action_has_service(d, "feec"))
            return BLE_TRACKER_CAT_TILE;
        if(ble_action_has_service(d, "fd5a")) return BLE_TRACKER_CAT_SMARTTAG;
        if(ble_action_has_service(d, "feaa")) return BLE_TRACKER_CAT_FIND_MY_DEV;
    }
    return 0;
}

/** Scan once and keep the exact advertisement object so random-address type is retained. */
static bool ble_action_find_target(
    const char* wanted,
    BLEAdvertisedDevice* target,
    int* category,
    bool* separated,
    int* rssi) {
    BLEScanResults found = FLOCK_SCAN(g_ble, 1);
    bool have = false;
    int best = -127;
    int n = found.getCount();
    for(int i = 0; i < n; i++) {
        BLEAdvertisedDevice d = found.getDevice(i);
        char addr[13];
        ble_action_compact_address(d, addr);
        if(strcmp(addr, wanted) != 0) continue;
        int signal = d.getRSSI();
        if(!have || signal > best) {
            *target = d;
            *category = ble_action_tracker_category(d, separated);
            best = signal;
            have = true;
        }
    }
    if(rssi) *rssi = best;
    return have;
}

static BLEClient* ble_action_connect(BLEAdvertisedDevice* target) {
    BLEClient* client = BLEDevice::createClient();
    if(!client || !client->connect(target)) {
        if(client) delete client;
        return nullptr;
    }
    return client;
}

static void ble_ring_notify(
    BLERemoteCharacteristic* /*characteristic*/,
    uint8_t* data,
    size_t length,
    bool /*isNotify*/) {
    // Command_Response: opcode 0x0302, then the command opcode and a uint16
    // response status, all little-endian per the non-owner protocol.
    if(length < 6) return;
    uint16_t response_opcode = (uint16_t)data[0] | ((uint16_t)data[1] << 8);
    uint16_t command_opcode = (uint16_t)data[2] | ((uint16_t)data[3] << 8);
    if(response_opcode == 0x0302 && command_opcode == 0x0300) {
        g_ring_response_status = (uint16_t)data[4] | ((uint16_t)data[5] << 8);
        g_ring_response_ready = true;
    }
}

static bool ble_ring_write_airtag(BLEClient* client, char status[16]) {
    BLERemoteService* service = client->getService(AIRTAG_SOUND_SERVICE);
    if(!service) return false;
    BLERemoteCharacteristic* characteristic = service->getCharacteristic(AIRTAG_SOUND_CHAR);
    if(!characteristic || (!characteristic->canWrite() && !characteristic->canWriteNoResponse()))
        return false;
    uint8_t command = 0xAF;
    characteristic->writeValue(&command, 1, true);
    snprintf(status, 16, "sent");
    return true;
}

static bool ble_ring_write_dult(BLERemoteService* service, char status[16]) {
    if(!service) return false;
    BLERemoteCharacteristic* characteristic = service->getCharacteristic(DULT_NON_OWNER_CHAR);
    if(!characteristic || (!characteristic->canWrite() && !characteristic->canWriteNoResponse()))
        return false;

    g_ring_response_ready = false;
    g_ring_response_status = 0xFFFF;
    if(characteristic->canIndicate() || characteristic->canNotify()) {
        // The DULT control point uses indications. The Arduino BLE API's first
        // boolean selects notifications, so false selects the indication CCCD.
        characteristic->registerForNotify(ble_ring_notify, !characteristic->canIndicate());
    }
    uint8_t command[] = {0x00, 0x03}; // Sound_Start 0x0300, little-endian
    characteristic->writeValue(command, sizeof(command), true);

    uint32_t deadline = millis() + 500;
    while(!g_ring_response_ready && (int32_t)(millis() - deadline) < 0) delay(10);
    if(!g_ring_response_ready) {
        snprintf(status, 16, "sent");
    } else if(g_ring_response_status == 0x0000) {
        snprintf(status, 16, "ok");
    } else if(g_ring_response_status == 0x0001) {
        snprintf(status, 16, "busy");
    } else {
        // 0xFFFF is the documented invalid-command response, which also covers
        // the owner-nearby case described by the Find My behavior.
        snprintf(status, 16, "rejected");
    }
    return true;
}

static bool ble_ring_write_legacy(BLEClient* client, char status[16]) {
    BLERemoteService* service = client->getService(FIND_MY_SERVICE);
    if(!service) return false;
    BLERemoteCharacteristic* characteristic = service->getCharacteristic(FIND_MY_NON_OWNER_CHAR);
    if(!characteristic || (!characteristic->canWrite() && !characteristic->canWriteNoResponse()))
        return false;
    uint8_t command[] = {0x01, 0x00, 0x03};
    characteristic->writeValue(command, sizeof(command), true);
    snprintf(status, 16, "sent");
    return true;
}

static void ble_action_ping(const char* wanted) {
    ble_ensure_init();
    esp_wifi_set_promiscuous(false);

    BLEAdvertisedDevice target;
    int category = 0;
    bool separated = false;
    int rssi = -127;
    if(!ble_action_find_target(wanted, &target, &category, &separated, &rssi)) {
        ble_action_emit("PING", "not_found", rssi, false);
        ble_action_restore_radio();
        return;
    }
    if(!ble_tracker_category_is_known((uint8_t)category)) {
        ble_action_emit("PING", "not_tracker", rssi, true);
        ble_action_restore_radio();
        return;
    }

    BLEClient* client = ble_action_connect(&target);
    if(!client) {
        ble_action_emit("PING", "connect_fail", rssi, true);
        ble_action_restore_radio();
        return;
    }
    client->disconnect();
    delete client;
    ble_action_emit("PING", "ok", rssi, true);
    ble_action_restore_radio();
}

