mruwzum/flipperzero-RogueMaster/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
static void handle_command(String cmd) {
    cmd.trim();
    // Any non-locate command ends Locator mode: unlock the Wi-Fi channel it
    // pinned, and restore promiscuous if BLE-locate had turned it off.
    if(!cmd.startsWith("locate")) {
        if(g_locate_kind == 'w') g_lock_channel = 0;
        if(g_locate_kind == 'b') {
            esp_wifi_set_promiscuous(true);
            set_channel(g_channel);
        }
        g_locate_kind = 0;
    }
    if(cmd.startsWith("gps")) {
        // gps            -> report current state
        // gps off        -> stop relaying, release Serial1
        // gps <rx> [baud]-> relay NMEA from that RX pin (default 9600)
        String a = cmd.substring(3);
        a.trim();
        if(a.length() == 0) {
            Serial.printf(
                "GPSCFG,%d,%d,%lu\n", g_gps_on ? 1 : 0, g_gps_rx, (unsigned long)g_gps_baud);
        } else if(a == "off") {
            gps_configure(-1, g_gps_baud);
        } else {
            int sp = a.indexOf(' ');
            int rx = (sp < 0 ? a : a.substring(0, sp)).toInt();
            uint32_t baud = 9600;
            if(sp >= 0) {
                long b = a.substring(sp + 1).toInt();
                if(b >= 1200 && b <= 921600) baud = (uint32_t)b;
            }
            // Ask the chip, don't assume the pinout. gps_pin_reject() is derived
            // entirely from this target's own IDF headers, so the pins it refuses
            // are this board's real flash bus and this board's real UART0 -- not
            // the classic ESP32's, which is what the old literal test encoded.
            const char* why = gps_pin_reject(rx);
            if(!why) {
                gps_configure(rx, baud);
            } else {
                Serial.printf("GPSCFG,0,%d,%lu\n", rx, (unsigned long)baud);
                Serial.printf("GPSERR,%d,%s\n", rx, why);
            }
        }
        return; // not a scan-mode command
    }
    if(cmd == "scan") {
        g_scanning = true;
        g_combo = false; // pure WiFi Flock
    } else if(cmd == "stop") {
        g_scanning = false;
        g_combo = false; // also leave dual-band mode so the board goes idle
    } else if(cmd == "ver") {
        banner();
    } else if(cmd == "wifiscan") {
        wifi_security_scan();
    } else if(cmd == "blescan") {
        ble_do_scan(6);
    } else if(cmd.startsWith("ble_ping ")) {
        String a = cmd.substring(9);
        a.trim();
        uint8_t mac[6];
        if(a.length() == 12 && parse_hexmac(a.c_str(), mac)) {
            ble_action_ping(a.c_str());
        } else {
            ble_action_emit("PING", "invalid", -127, false);
        }
    } else if(cmd.startsWith("ble_ring ")) {
        String a = cmd.substring(9);
        a.trim();
        uint8_t mac[6];
        if(a.length() == 12 && parse_hexmac(a.c_str(), mac)) {
            ble_action_ring(a.c_str());
        } else {
            ble_action_emit("RING", "invalid", -127, false);
        }
    } else if(cmd == "flockcombo") {
        g_scanning = true;
        g_combo = true; // interleaved WiFi + BLE Flock detection
        g_phase_start = millis();
    } else if(cmd == "flockwifi") {
        g_combo = false;
    } else if(cmd.startsWith("ch ")) {
        int n = cmd.substring(3).toInt();
        // 1-14 are 2.4 GHz; 36-177 are the 5 GHz channels (C5 only). Anything
        // else, including 0, means "resume hopping".
        bool ok_24 = (n >= 1 && n <= 14);
        bool ok_5 = false;
#if FLOCK_HAS_5GHZ
        for(size_t i = 0; i < CHANNELS_5G_COUNT; i++) {
            if(n == CHANNELS_5G[i]) {
                ok_5 = true;
                break;
            }
        }
#endif
        if(ok_24 || ok_5) {
            g_lock_channel = (uint8_t)n;
            set_channel((uint8_t)n);
        } else {
            g_lock_channel = 0;
        }
    } else if(cmd.startsWith("band")) {
        // band 2g|5g|all -- pick which band(s) the hopper sweeps.
        // Always ACKs with the band actually in force, which on a 2.4-only chip
        // is 2g whatever was asked: silently accepting "5g" on a radio that has
        // no 5 GHz would report coverage that does not exist.
        String a = cmd.substring(4);
        a.trim();
#if FLOCK_HAS_5GHZ
        if(a == "5g")
            g_band = FlockBand5G;
        else if(a == "all")
            g_band = FlockBandAll;
        else if(a == "2g")
            g_band = FlockBand2G;
#else
        g_band = FlockBand2G;
#endif
        g_hop_i = 0;
        g_lock_channel = 0;
        set_channel(hop_channel(0));
        Serial.printf(
            "BAND,%s,%u\n",
            (g_band == FlockBand5G) ? "5g" : ((g_band == FlockBandAll) ? "all" : "2g"),
            (unsigned)hop_count());
    } else if(cmd.startsWith("locate")) {
        // locate <w|b> <hexmac> [ch]   -> stream LOC,<rssi> for that target
        // locate off                   -> stop
        if(cmd.indexOf("off") > 0) {
            if(g_locate_kind == 'b') {
                esp_wifi_set_promiscuous(true);
                set_channel(g_channel);
            }
            g_locate_kind = 0;
            g_lock_channel = 0;
        } else {
            int s1 = cmd.indexOf(' ');
            int s2 = (s1 > 0) ? cmd.indexOf(' ', s1 + 1) : -1;
            int s3 = (s2 > 0) ? cmd.indexOf(' ', s2 + 1) : -1;
            if(s1 > 0 && s2 > s1) {
                char kind = cmd.charAt(s1 + 1);
                String macs = (s3 > s2) ? cmd.substring(s2 + 1, s3) : cmd.substring(s2 + 1);
                macs.toLowerCase();
                uint8_t mac[6];
                if(macs.length() >= 12 && parse_hexmac(macs.c_str(), mac)) {
                    // promisc_cb() memcmp's g_locate_mac from the WiFi task, so a
                    // plain memcpy here can be observed half-applied and the
                    // Locator homes on a spliced old/new address. Swap the target
                    // and arm g_locate_kind together, under the lock -- kind is
                    // what gates the compare, so publishing it last inside the
                    // same section makes the whole target visible atomically.
                    portENTER_CRITICAL(&g_mux);
                    memcpy(g_locate_mac, mac, 6);
                    strncpy(g_locate_macs, macs.c_str(), 12);
                    g_locate_macs[12] = 0;
                    g_locate_kind = (kind == 'b') ? 'b' : 'w';
                    portEXIT_CRITICAL(&g_mux);
                    g_locate_ch = (s3 > s2) ? (uint8_t)cmd.substring(s3 + 1).toInt() : 0;
                    g_locate_best = -127;
                    g_scanning = false; // Locator dedicates the radio to one target
                    g_combo = false;
                    if(g_locate_kind == 'w') {
                        esp_wifi_set_promiscuous(true);
                        if(g_locate_ch >= 1 && g_locate_ch <= 14) {
                            g_lock_channel = g_locate_ch;
                            set_channel(g_locate_ch);
                        } else {
                            g_lock_channel = 0;
                        }
                    }
                }
            }
        }
    }
}

void loop() {
    if(Serial.available()) {
        handle_command(Serial.readStringUntil('\n'));
    }

    // Before every early return below: a fix must keep flowing in Locator mode
    // and while idle, or detections geotag with a stale position (or none).
    // The blocking BLE scans drain the GPS between their 1-second slices too
    // (see ble_do_scan), so no phase of the rotation stalls this for longer than
    // about a second.
    gps_poll();

